//=============================================================================
//
// フェンスのモデル処理 [fence.h]
// Author : 星克昌
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_FENCE		(25)				// フェンスの数

#define	FENSE_SIZE		(5.0f)				// 当たり判定の大きさ
#define FENCE_OFFSET_Y	(24.0f)				// フェンスを地面にあわせる

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct FENCE
{
	XMFLOAT4X4			mtxWorld;			// ワールドマトリックス
	XMFLOAT3			pos;				// モデルの位置
	XMFLOAT3			rot;				// モデルの向き(回転)
	XMFLOAT3			scl;				// モデルの大きさ(スケール)

	BOOL				use;
	BOOL				load;
	DX11_MODEL			model;				// モデル情報
	XMFLOAT4			diffuse[MODEL_MAX_MATERIAL];	// モデルの色

	float				size;				// 当たり判定の大きさ
	int					shadowIdx;			// 影のインデックス番号
	
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitFence(void);
void UninitFence(void);
void UpdateFence(void);
void DrawFence(void);

FENCE *GetFence(void);

