//=============================================================================
//
// 扉のモデル処理 [gate.h]
// Author : 星克昌
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_GATE		(1)					// ゲートの数

#define	GATE_SIZE		(30.0f)				// 当たり判定の大きさ
#define GATE_OFFSET_Y	(0.0f)				// フェンスを地面にあわせる

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct GATE
{
	XMFLOAT4X4			mtxWorld;			// ワールドマトリックス
	XMFLOAT3			pos;				// モデルの位置
	XMFLOAT3			rot;				// モデルの向き(回転)
	XMFLOAT3			scl;				// モデルの大きさ(スケール)

	BOOL				use;
	BOOL				load;
	DX11_MODEL			model;				// モデル情報
	XMFLOAT4			diffuse[MODEL_MAX_MATERIAL];	// モデルの色

	float				size;				// 当たり判定の大きさ
	int					shadowIdx;			// 影のインデックス番号
	
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitGate(void);
void UninitGate(void);
void UpdateGate(void);
void DrawGate(void);

GATE *GetGate(void);

