//=============================================================================
//
// 小屋のモデル処理 [hut.h]
// Author : 星克昌
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_HUT		(3)						// 小屋の数

#define	HUT_SIZE		(5.0f)				// 当たり判定の大きさ
#define HUT_OFFSET_Y	(0.0f)				// 小屋を地面にあわせる

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct HUT
{
	XMFLOAT4X4			mtxWorld;			// ワールドマトリックス
	XMFLOAT3			pos;				// モデルの位置
	XMFLOAT3			rot;				// モデルの向き(回転)
	XMFLOAT3			scl;				// モデルの大きさ(スケール)

	BOOL				use;
	BOOL				load;
	DX11_MODEL			model;				// モデル情報
	XMFLOAT4			diffuse[MODEL_MAX_MATERIAL];	// モデルの色

	float				size;				// 当たり判定の大きさ
	int					shadowIdx;			// 影のインデックス番号
	
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitHut(void);
void UninitHut(void);
void UpdateHut(void);
void DrawHut(void);

HUT *GetHut(void);

