//=============================================================================
//
// 鍵アイコンの処理 [key_icon.h]
// Author : 星克昌
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define KEYICON_OFFSET_Y	(45.0f)		// 鍵アイコンの高さ

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct KEYICON
{
	XMFLOAT3			pos;			// 位置
	XMFLOAT3			scl;			// スケール
	XMFLOAT3			rot;			// ポリゴンの向き(回転)
	MATERIAL			material;		// マテリアル
	float				fWidth;			// 幅
	float				fHeight;		// 高さ
	float				p_dist;			// プレイヤーまでの距離
	BOOL				bUse;			// 使用しているかどうか

	INTERPOLATION_DATA	*tbl_adr;		// アニメデータのテーブル先頭アドレス
	int					tbl_size;		// 登録したテーブルのレコード総数
	float				move_time;		// 実行時間

};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitKeyIcon(void);
void UninitKeyIcon(void);
void UpdateKeyIcon(void);
void DrawKeyIcon(void);

int SetKeyIcon(XMFLOAT3 pos, float fWidth, float fHeight, XMFLOAT4 col);

KEYICON *GetKeyIcon(void);

