//=============================================================================
//
// 岩のモデル処理 [rock.h]
// Author : 星克昌
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_ROCK		(4)					// 岩の数

#define	ROCK_SIZE		(5.0f)				// 当たり判定の大きさ
#define ROCK_OFFSET_Y	(0.0f)				// 岩を地面にあわせる

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct ROCK
{
	XMFLOAT4X4			mtxWorld;			// ワールドマトリックス
	XMFLOAT3			pos;				// モデルの位置
	XMFLOAT3			rot;				// モデルの向き(回転)
	XMFLOAT3			scl;				// モデルの大きさ(スケール)

	BOOL				use;
	BOOL				load;
	DX11_MODEL			model;				// モデル情報
	XMFLOAT4			diffuse[MODEL_MAX_MATERIAL];	// モデルの色

	float				size;				// 当たり判定の大きさ
	int					shadowIdx;			// 影のインデックス番号
	
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitRock(void);
void UninitRock(void);
void UpdateRock(void);
void DrawRock(void);

ROCK *GetRock(void);

